/**
 * Задание 4. Написание кода - сделано
Что нужно сделать:
Используя примитивную типизацию с помощью TypeScript, напишите код, который:
принимает строку из нескольких слов, разделённых пробелами, возвращает строку со словами в отзеркаленном виде, причём последовательность слов должна быть сохранена.
Пример:
"Это пример!" ==> "отЭ !ремирп"
Советы и рекомендации
Проверьте работу кода не только на фразе «Это пример!», но и на менее очевидных граничных случаях. Например, при вводе только пробелов без слов.

Критерии оценки
Принято:
Код корректно работает в примере и других случаях (например, при отсутствии слов).
Использована типизация примитивов.
Аргументы и возвращаемое значение функции типизированы.
На доработку:
Код не проходит все кейсы.
В коде не использована типизация.
 */

function reverseString(phrase: string) {
    if (phrase.trim().length > 1) {
        return phrase.split("").reverse().join("");
    } 
    else {
        console.log('введите более одной буквы или фразу!')
    }
} 
 
console.log(reverseString('Это пример!'));