/**Задание 5. Объекты v2 — код
 * 
Что нужно сделать:
-Реализуйте функцию areEqual, которая принимает два объекта в качестве аргументов. Не забывайте про типизацию.
-Если два переданных объекта содержат одинаковое количество ключей с одинаковыми значениями и одинаковыми названиями ключей — функция должна вернуть true. Иначе — false.

Советы и рекомендации:
-Для итерации по объектам используйте получение ключей через Object.keys(objectA) и Object.keys(objectB) — это поможет избежать возможных ошибок с типами.
-В процессе проработки задания вам важно потренировать навыки создания объектов и работы с полями объектов. Постарайтесь делать это осознанно.
 */